// 점선면 페이지 데이터
export const dotlineImages = [
  { title: '점선면 이미지 1', src: '/images/인생그래프1.jpg' },
  { title: '점선면 이미지 2', src: '/images/인생그래프2.jpg' },
 
]

export const dotlineAudio = [
  { id: 'da1', title: '나의 인생음악', src: '/audio/나의인생음악.wav' },
]

// 시 페이지 데이터
export const poetryImages = [
  { id: 'pi1', title: '시 이미지 1', src: '/images/나의이미지.png' },
]

export const poetryTexts = [
  { 
    id: 'pt1', 
    title: '나의 인생', 
    content: `처음의 나는
엄마의 웃음 속에서 자라났다
아침밥 냄새, 가족의 웃음소리,
그 모든 것이 나의 점이 되었다

여행길에서 바람이 불면
가족의 손을 잡고 웃었다
그때는 몰랐다
행복이 얼마나 가까운지

시간이 흘러
일과 책임의 무게 속에서
나는 조금씩 어른이 되었다
지치고, 흔들리면서도
이루어내는 기쁨에 다시 숨을 쉬었다

그러다 어느 날
엄마의 숨소리가 약해졌다
그 옆에서 나는 기도했다
“조금만 더, 함께 있어 주세요”

이제는 하늘이 엄마의 자리
그리움은 매일의 그림자처럼 따라온다
하지만 나는 안다
그 사랑이 내 안에 여전히 자란다는 걸

그래서 오늘도 다짐한다
쓰러져도 다시 일어나자
나를 돌보며,
엄마가 주신 삶을 정성껏 살아가자

그리움은 끝이 아니다
사랑은 여전히 나를 피어나게 한다`
  },
]

// 노래 페이지 데이터
export const songTexts = [
  { 
    id: 'st1', 
    title: '나의 노래', 
    content: `처음의 나는 엄마의 품 안에서 웃었다
밥 냄새, 손길, 작은 말 한마디가 세상의 전부였다
가족과 함께한 길 위의 바람, 
사진 속 웃음들은 내 마음의 첫 점으로 남았다
세상 속으로 나아가며 나는 어른이 되었다
지치고 흔들려도 이루어낸 순간마다 엄마의 미소가 겹쳐졌다
그러던 어느 날 그 미소가 희미해지고 
손끝이 닿지 않는 거리에 엄마가 있었다
그리움이 하루를 채우고 눈물이 밤을 대신했다
그러나 나는 안다 사랑은 떠나지 않는다는 걸
모양만 바뀌어 내 안에서 다시 피어난다는 걸
그래서 오늘도 나는 다짐한다 무너지지 않겠다고 
나를 돌보며 살아가겠다고 
엄마의 사랑으로 다시 피어나는 내가 되겠다고`
  },
]

export const songAudio = [
  { id: 'sa1', title: '나의인생', src: '/audio/나의노래.mp3' },
]


